In [33]:
import pandas as pd
import numpy as np
from csv import writer

data = pd.read_csv("kpop idols.csv")
display(data)

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Height,Weight,Birthplace,Gender,Instagram
0,Taeyeon,Kim Taeyeon,김태연,태연,3/9/1989,SNSD,South Korea,160,44,Jeonju,F,taeyeon_ss
1,Sunny,Lee Sunkyu,이순규,써니,5/15/1989,SNSD,South Korea,158,43,California,F,svnnynight
2,Tiffany,Hwang Miyoung,황미영,티파니,8/1/1989,SNSD,South Korea,163,50,San Francisco,F,xolovestephi
3,Hyoyeon,Kim Hyoyeon,김효연,효연,9/22/1989,SNSD,South Korea,158,48,Incheon,F,watasiwahyo
4,Yuri,Kwon Yuri,권유리,유리,12/5/1989,SNSD,South Korea,167,45,Goyang,F,yulyulk
...,...,...,...,...,...,...,...,...,...,...,...,...
1661,Minji,Kim Minji,김민지,민지,5/7/2004,NewJeans,South Korea,169,0,Yeongwol,F,NaN
1662,Hanni,Pham Ngoc Han,팜응옥헌,하니,10/6/2004,NewJeans,Vietnam,162,0,Melbourne,F,NaN
1663,Danielle,Mo Jihye,모지혜,다니엘,4/11/2005,NewJeans,South Korea,165,0,Munsan,F,NaN
1664,Haerin,Kang Haerin,강해린,해린,5/15/2006,NewJeans,South Korea,165,0,Gimcheon,F,NaN
1665,Hyein,Lee Hyein,이혜인,혜인,4/21/2008,NewJeans,South Korea,170,0,Incheon,F,NaN

In [4]:
data.isnull().sum()

Stage Name           0
Full Name            7
Korean Name          8
K. Stage Name        1
Date of Birth        0
Group              138
Country              0
Height               0
Weight               0
Birthplace         897
Gender               0
Instagram         1510
dtype: int64

In [5]:
data['Group '].unique

<bound method Series.unique of 0           SNSD
1           SNSD
2           SNSD
3           SNSD
4           SNSD
          ...
1661    NewJeans
1662    NewJeans
1663    NewJeans
1664    NewJeans
1665    NewJeans
Name: Group , Length: 1666, dtype: object>

In [36]:
#new group
ng=data[data['Group ']=='DAY6']
display(ng)

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Height,Weight,Birthplace,Gender,Instagram
523,Jae,Park Jaehyung,박제형,제이,9/15/1992,DAY6,South Korea,0,0,Buenos Aires,M,NaN
524,Sungjin,Park Sungjin,박성진,성진,1/16/1993,DAY6,South Korea,0,0,NaN,M,NaN
525,Young K,Kang Young-hyun,강영현,영케이,12/19/1993,DAY6,South Korea,0,0,NaN,M,NaN
526,Wonpil,Kim Wonpil,김원필,원필,4/28/1994,DAY6,South Korea,0,0,NaN,M,NaN
527,Dowoon,Yoon Dowoon,윤도운,도운,8/25/1995,DAY6,South Korea,0,0,NaN,M,NaN

In [19]:
fi=data[data['Country ']!='South Korea']
display(fi)

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Height,Weight,Birthplace,Gender,Instagram
57,Fei,Wang FeiFei,왕페이페이,페이,4/27/1987,miss A,China,165,0,Haikou,F,ff0427
58,Jia,Meng Jia,멍지아,지아,2/3/1989,miss A,China,166,0,Changja,F,mjbaby0203
66,Momo,Hirai Momo,히라이 모모,모모,11/9/1996,Twice,Japan,167,0,Kyoto,F,NaN
67,Sana,Minatozaki Sana,미나토자키 사나,사나,12/29/1996,Twice,Japan,168,0,Osaka,F,NaN
68,Mina,Myoui Mina,묘이 미나,미나,3/24/1997,Twice,Japan,163,0,San Antonio,F,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1629,Kazuha,Nakamura Kazuha,나카무라 카즈하,카즈하,8/9/2003,LE SSERAFIM,Japan,174,0,Osaka,F,NaN
1636,Chanty,Maria Chantal Videla,마리아 샹탈 비델라,샨티,12/15/2002,Lapillus,Philippines,170,0,Manila,F,NaN
1637,Shana,Nonaka Shana,노나카 샤나,샤나,3/13/2003,Lapillus,Japan,158,0,Kochi,F,NaN
1638,Yue,Nancy Yang,낸시 양,유에,7/3/2004,Lapillus,USA,163,48,NaN,F,NaN
1662,Hanni,Pham Ngoc Han,팜응옥헌,하니,10/6/2004,NewJeans,Vietnam,162,0,Melbourne,F,NaN

In [20]:
cn=fi[(fi['Country '] == 'Japan') & (fi['Group '] == 'Kep1er')]
display(cn)

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Height,Weight,Birthplace,Gender,Instagram
1562,Mashiro,Sakamoto Mashiro,사카모토 마시로,마시로,12/16/1999,Kep1er,Japan,157,0,NaN,F,NaN
1563,Hikaru,Ezaki Hikaru,에자키 히카루,히카루,3/12/2004,Kep1er,Japan,155,0,NaN,F,NaN

In [9]:
#females
gg=data[data['Gender '] == 'F']
gg.to_csv('girlgroups.csv')
display(gg)

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Height,Weight,Birthplace,Gender,Instagram
0,Taeyeon,Kim Taeyeon,김태연,태연,3/9/1989,SNSD,South Korea,160,44,Jeonju,F,taeyeon_ss
1,Sunny,Lee Sunkyu,이순규,써니,5/15/1989,SNSD,South Korea,158,43,California,F,svnnynight
2,Tiffany,Hwang Miyoung,황미영,티파니,8/1/1989,SNSD,South Korea,163,50,San Francisco,F,xolovestephi
3,Hyoyeon,Kim Hyoyeon,김효연,효연,9/22/1989,SNSD,South Korea,158,48,Incheon,F,watasiwahyo
4,Yuri,Kwon Yuri,권유리,유리,12/5/1989,SNSD,South Korea,167,45,Goyang,F,yulyulk
...,...,...,...,...,...,...,...,...,...,...,...,...
1661,Minji,Kim Minji,김민지,민지,5/7/2004,NewJeans,South Korea,169,0,Yeongwol,F,NaN
1662,Hanni,Pham Ngoc Han,팜응옥헌,하니,10/6/2004,NewJeans,Vietnam,162,0,Melbourne,F,NaN
1663,Danielle,Mo Jihye,모지혜,다니엘,4/11/2005,NewJeans,South Korea,165,0,Munsan,F,NaN
1664,Haerin,Kang Haerin,강해린,해린,5/15/2006,NewJeans,South Korea,165,0,Gimcheon,F,NaN
1665,Hyein,Lee Hyein,이혜인,혜인,4/21/2008,NewJeans,South Korea,170,0,Incheon,F,NaN

In [32]:
#males
bg=data[data['Gender ']=='M']
bg.to_csv('boygroups.csv')
bg.head()

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Height,Weight,Birthplace,Gender,Instagram
247,T.O.P,Choi Seunghyun,최승현,탑,11/4/1987,BIGBANG,South Korea,180,65,Seoul,M,NaN
248,Taeyang,Dong Youngbae,동영배,태양,5/18/1988,BIGBANG,South Korea,174,56,Uljeongbu,M,NaN
249,G-Dragon,Kwon Jiyong,권지용,지드래곤,8/18/1988,BIGBANG,South Korea,177,58,Seoul,M,NaN
250,Daesung,Daesung,강대성,대성,4/26/1989,BIGBANG,South Korea,178,63,Incheon,M,NaN
251,Seungri,Lee Seunghyun,이승현,승리,12/12/1990,NaN,South Korea,176,60,Gwangju,M,NaN